Pandas is one of the most used module for Machine learning and Data Analysis.

Pandas makes working with tables (.csv, .tsv, .xlsx, etc) very convenient. Also, Pandas provides a wide range of opportunities for visualization.

The main data structures are implemented with **Series** (one dimensional indexed array) and **DataFrame** (like a table) classes.

In [1]:
import numpy as np
import pandas as pd
from sklearn.model_selection import train_test_split
from sklearn.ensemble import RandomForestClassifier
from sklearn.metrics import accuracy_score

The goal of this module is to build a ML model to predict survival of a person (Titanic competition from kaggle).

Data provided with notebook: **titanic.csv**

In [2]:
df = pd.read_csv('titanic.csv')
df.drop(['PassengerId'], axis=1, inplace=True)
df.head()  # is useful to take a look at several first lines, 5 by default

,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [3]:
df.head(3).T  # another very useful representation

,0,1,2
Survived,0,1,1
Pclass,3,1,3
Name,"Braund, Mr. Owen Harris","Cumings, Mrs. John Bradley (Florence Briggs Th...","Heikkinen, Miss. Laina"
Sex,male,female,female
Age,22,38,26
SibSp,1,1,0
Parch,0,0,0
Ticket,A/5 21171,PC 17599,STON/O2. 3101282
Fare,7.25,71.2833,7.925
Cabin,NaN,C85,NaN
Embarked,S,C,S

In [4]:
df.shape  # to see dimensions of dataframe

(891, 11)

In [5]:
columns = ['Pclass', 'Age', 'SibSp', 'Parch', 'Fare', 'Survived']
df = df[columns]  # make slice to get rid of non numeric columns. It is the first approximation

In [6]:
df.fillna(0, inplace=True)  # several values = NaN, replace them on 0

In [7]:
y = df['Survived']  # take secific column. y is pd.Series now
X = df.drop(['Survived'], axis=1)  # remove 'Survived' from X data

In [8]:
X_train, X_test, y_train, y_test = train_test_split(X, y, test_size=0.33, random_state=42)  # func to split data

In [9]:
def get_prediction(X_train, y_train, y_test):
    clf = RandomForestClassifier(n_estimators=10, random_state=42)
    clf.fit(X_train, y_train)
    pred = clf.predict(X_test)
    acc = accuracy_score(y_test, pred)
    return acc


acc = get_prediction(X_train, y_train, y_test)
print('ACCURACY = {}'.format(acc))

ACCURACY = 0.6677966101694915

In [10]:
# Yor task is to improve ACCURACY
# DON'T use y_train while make predictions! It will be checked!
# You need to beat 80% ACC